#Использовать 1testrunner
#Использовать fs

Функция ПрогнатьТесты()

	Тестер = Новый Тестер;
	Тестер.УстановитьФорматЛогФайла(Тестер.ФорматыЛогФайла().GenericExec);

	ПутьКТестам = "tests";
	ПутьКОтчетуJUnit = "out";

	ФС.ОбеспечитьПустойКаталог(ПутьКОтчетуJUnit);

	РезультатТестирования = Тестер.ТестироватьКаталог(
		Новый Файл(ПутьКТестам),
		Новый Файл(ПутьКОтчетуJUnit)
	);

	Успешно = РезультатТестирования = 0;

	Возврат Успешно;
КонецФункции

ТекКаталог = ТекущийКаталог();

Попытка
	ТестыПрошли = ПрогнатьТесты();
Исключение
	ТестыПрошли = Ложь;
	ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	Сообщение = СтрШаблон("Тесты через 1testrunner выполнены неудачно
	|%1", ТекстОшибки);
	Сообщить(Сообщение);
КонецПопытки;

УстановитьТекущийКаталог(ТекКаталог);

Если Не ТестыПрошли Тогда
	ВызватьИсключение "Тестирование завершилось неудачно!";
Иначе
	Сообщение = СтрШаблон("Результат прогона тестов <%1>
	|", ТестыПрошли);
	Сообщить(Сообщение);
КонецЕсли;
