#Использовать autumn
#Использовать ".."
#Использовать asserts
#Использовать fs

// Каталог, из которого запущен тест (для восстановления в ПослеЗапускаТеста).
Перем ТекущийКаталог;

Процедура ПередЗапускомТеста() Экспорт	
	ТекущийКаталог = ТекущийКаталог();
	КаталогИнициализацииПриложения = "out/tmp";
	ФС.ОбеспечитьПустойКаталог(КаталогИнициализацииПриложения);
	УстановитьТекущийКаталог(ОбъединитьПути(ТекущийКаталог(), КаталогИнициализацииПриложения));
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
	УстановитьТекущийКаталог(ТекущийКаталог);
КонецПроцедуры

&Тест
Процедура ИнициализацияКаталогаПриложения() Экспорт

	// Дано
	ФС.ОбеспечитьПустойКаталог("testapp");
	Поделка = Новый Поделка();
	Поделка.ЗапуститьПриложение();
	ВстраивательМетрик = Поделка.НайтиЖелудь("ВстраивательМетрик");
	
	// Когда
	ВстраивательМетрик.ПроинициализироватьКаталог("testapp");

	// Тогда
	Ожидаем.Что(ФС.ФайлСуществует("testapp/КонтролМетрик.os")).Равно(Истина);

КонецПроцедуры