
// BSLLS:MissingVariablesDescription-off

&Аргумент(Имя = "PATH", Описание = "Относительный путь каталога приложений, текущий каталог <.> (точка)")
&ТСтрока
&ПоУмолчанию(".")
Перем Путь;

&Пластилин
Перем ВстраивательМетрик;

// BSLLS:MissingVariablesDescription-on

&КомандаПриложения(Имя = "embed", Описание = "Встраивание контроллера /metrics в каталог приложений")
Процедура ПриСозданииОбъекта()	
КонецПроцедуры

&ВыполнениеКоманды
Процедура Запустить() Экспорт
	ВстраивательМетрик.ПроинициализироватьКаталог(Путь);
КонецПроцедуры
