#Использовать fs
#Использовать autumn-logos

// BSLLS:MissingVariablesDescription-off

&Лог("prometheus-metrics.embedder")
Перем Лог;

Перем ШаблонКонтрола;

// BSLLS:MissingVariablesDescription-on

&Желудь
Процедура ПриСозданииОбъекта()
	ШаблонКонтрола = ОбъединитьПути(ТекущийСценарий().Каталог, "..", "Controls");
КонецПроцедуры

Процедура ПроинициализироватьКаталог(КаталогИнициализации = ".") Экспорт

	ПолныйПуть = ОбъединитьПути(ТекущийКаталог(), КаталогИнициализации);
	СоздатьКаталогПриложений(ПолныйПуть);

КонецПроцедуры

Процедура СоздатьКаталогПриложений(ПолныйПуть)
	ОбеспечитьКаталог(ПолныйПуть);
	ПеренестиФайлИзШаблона("КонтролМетрик.os", ОбъединитьПути(ПолныйПуть, "КонтролМетрик.os"));
КонецПроцедуры

Процедура ОбеспечитьКаталог(Каталог)
	Если НЕ ФС.КаталогСуществует(Каталог) Тогда
		ФС.ОбеспечитьКаталог(Каталог);
		Лог.Информация(СтрШаблон("Создан каталог %1", Каталог));
	КонецЕсли;
КонецПроцедуры

Процедура ПеренестиФайлИзШаблона(ИмяШаблона, КудаПереносить)
	ФайлШаблона = ОбъединитьПути(ШаблонКонтрола, ИмяШаблона);

	Если НЕ ФС.ФайлСуществует(КудаПереносить) Тогда
		КопироватьФайл(ФайлШаблона, КудаПереносить);
		Лог.Информация(СтрШаблон("Создан файл %1", КудаПереносить));
	КонецЕсли;
КонецПроцедуры
